[
    {
      "id": 1,
      "roomName": "Cityscape Haven",
      "image": "https://i.postimg.cc/qvVQY26v/room1.jpg",
      "description": "Experience urban living at its finest in our Cityscape Haven. This cozy single room offers stunning views of the city skyline, providing the perfect backdrop for your stay. Relax in comfort and style as you take in the bustling city below. Ideal for solo travelers or couples seeking a romantic getaway.",
      "pricePerNight": 80,
      "roomSize": "Single (1 person)",
      "availability": "Avilable",
      "specialOffers": "10% off for bookings of 3 nights or more",
      "reviewCount": 0
    },
    {
      "id": 2,
      "roomName": "Garden Terrace Retreat",
      "image": "https://i.postimg.cc/BnTNGt2c/room2.jpg",
      "description": "Escape to tranquility in our Garden Terrace Retreat. This spacious double room features a private garden terrace, where you can unwind amidst lush greenery and blooming flowers. Perfect for couples or friends looking to relax and rejuvenate in a serene setting.",
      "pricePerNight": 120,
      "roomSize": "Double (2 persons)",
      "availability": "Unavilable",
      "specialOffers": "",
      "reviewCount": 0
    },
    {
      "id": 3,
      "roomName": "Ocean Vista Suite",
      "image": "https://i.postimg.cc/d0J6QvBM/room3.jpg",
      "description": "Indulge in luxury at our Ocean Vista Suite. This opulent suite boasts panoramic ocean views from its private balcony, offering a breathtaking backdrop for your stay. With spacious accommodations and deluxe amenities, it's the perfect choice for couples seeking a romantic retreat or families looking to enjoy coastal living at its finest.",
      "pricePerNight": 250,
      "roomSize": "Suite (2-4 persons)",
      "availability": "Avilable",
      "specialOffers": "",
      "reviewCount": 0
    },
    {
      "id": 4,
      "roomName": "Mountain View Retreat",
      "image": "https://i.postimg.cc/5tp36G7X/room4.jpg",
      "description": "Discover rustic charm at our Mountain View Retreat. Nestled amidst majestic mountains, this charming twin room offers picturesque views and cozy accommodations. Perfect for nature lovers or those seeking a peaceful escape from the hustle and bustle of city life.",
      "pricePerNight": 100,
      "roomSize": "Twin (2 persons)",
      "availability": "Avilable",
      "specialOffers": "",
      "reviewCount": 0
    },
    {
      "id": 5,
      "roomName": "Rustic Cabin Hideaway",
      "image": "https://i.postimg.cc/yddT9Ptv/room5.jpg",
      "description": "Experience the beauty of nature in our Rustic Cabin Hideaway. This cozy cabin offers a peaceful retreat surrounded by towering trees and serene landscapes. Perfect for couples or small families looking to reconnect with nature and escape the stresses of everyday life.",
      "pricePerNight": 150,
      "roomSize": "Cabin (2-3 persons)",
      "availability": "Avilable",
      "specialOffers": "20% off for bookings made 30 days in advance",
      "reviewCount": 0
    },
    {
      "id": 6,
      "roomName": "Family Poolside Apartment",
      "image": "https://i.postimg.cc/9XD6Ht0d/room6.jpg",
      "description": "Make unforgettable memories in our Family Poolside Apartment. This spacious apartment offers comfortable accommodations and direct access to our sparkling pool, perfect for family fun in the sun. With plenty of room for everyone to relax and unwind, it's the ultimate choice for your next family vacation.",
      "pricePerNight": 180,
      "roomSize": "Apartment (4-6 persons)",
      "availability": "Avilable",
      "specialOffers": "",
      "reviewCount": 0
    },
    {
      "id": 7,
      "roomName": "Traditional Tatami Retreat",
      "image": "https://i.postimg.cc/j5F4hfrK/room7.jpg",
      "description": "Immerse yourself in Japanese culture at our Traditional Tatami Retreat. This authentic tatami room offers a tranquil setting for relaxation and reflection, with traditional Japanese design elements and serene ambiance. Perfect for solo travelers or couples seeking an authentic cultural experience.",
      "pricePerNight": 90,
      "roomSize": "Tatami (2 persons)",
      "availability": "Unavilable",
      "specialOffers": "",
      "reviewCount": 0
    },
    {
      "id": 8,
      "roomName": "Skyline Loft Escape",
      "image": "https://i.postimg.cc/65RFyWdT/room8.jpg",
      "description": "Experience luxury living in our Skyline Loft Escape. This contemporary loft features floor-to-ceiling windows offering breathtaking skyline views, creating a stunning backdrop for your stay. With modern amenities and stylish furnishings, it's the perfect choice for discerning travelers seeking sophistication and comfort.",
      "pricePerNight": 200,
      "roomSize": "Loft (2 persons)",
      "availability": "Avilable",
      "specialOffers": "",
      "reviewCount": 0
    },
    {
      "id": 9,
      "roomName": "Sunset View Bungalow",
      "image": "https://i.postimg.cc/nLxRsqnP/romm9.jpg",
      "description": "Experience the magic of sunset at our Sunset View Bungalow. This cozy bungalow offers stunning sunset views from its private terrace, creating the perfect setting for a romantic escape or a peaceful retreat. With comfortable accommodations and serene surroundings, it's the ideal choice for a memorable getaway.",
      "pricePerNight": 120,
      "roomSize": "Bungalow (2 persons)",
      "availability": "Avilable",
      "specialOffers": "",
      "reviewCount": 0
    },
    {
      "id": 10,
      "roomName": "Lakeside Cabin Retreat",
      "image": "https://i.postimg.cc/tgzrF7TC/romm10.jpg",
      "description": "Escape to serenity in our Lakeside Cabin Retreat. Nestled along the shores of a tranquil lake, this secluded cabin offers panoramic views and cozy accommodations. Perfect for nature enthusiasts or couples seeking a romantic getaway, it's the ultimate destination for relaxation and rejuvenation.",
      "pricePerNight": 180,
      "roomSize": "Cabin (2-3 persons)",
      "availability": "Avilable",
      "specialOffers": "15% off for bookings of 5 nights or more",
      "reviewCount": 0
    },
    {
      "id": 11,
      "roomName": "Urban Studio Loft",
      "image": "https://i.postimg.cc/sfLTYkVS/romm11.jpg",
      "description": "Discover urban living at its best in our Urban Studio Loft. This modern studio loft offers stylish accommodations and convenient amenities, making it the perfect choice for city explorers and business travelers alike. With its central location and contemporary design, it's sure to exceed your expectations.",
      "pricePerNight": 150,
      "roomSize": "Studio (1-2 persons)",
      "availability": "Avilable",
      "specialOffers": "",
      "reviewCount": 0
    },
    {
      "id": 12,
      "roomName": "Beachfront Villa",
      "image": "https://i.postimg.cc/gk6NNgJ7/room12.jpg",
      "description": "Experience luxury beachfront living in our Beachfront Villa. This luxurious villa offers direct access to the beach and breathtaking ocean views, creating the perfect setting for a tropical getaway. With spacious accommodations and upscale amenities, it's the ultimate choice for a memorable beach vacation with family and friends.",
      "pricePerNight": 300,
      "roomSize": "Villa (4-8 persons)",
      "availability": "Avilable",
      "specialOffers": "",
      "reviewCount": 0
    }
  ]
  